<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DepartmentSeeder extends Seeder
{
    public function run(): void
    {
        $departments = [
            '1' => [
                'name' => 'Кафедра  теплоенергетики та енергозберігаючих технологій',
                'city' => 'Харків',
            ],
            '2' => [
                'name' => 'Кафедра охорони праці, стандартизації та сертифікації',
                'city' => 'Харків',
            ],
            '3' => [
                'name' => 'Кафедра фізики, електротехніки і електроенергетики',
                'city' => 'Харків',
            ],
            '4' => [
                'name' => 'Кафедра інтегрованих технологій в машинобудуванні та зварювального виробництва',
                'city' => 'Харків',
            ],
            '5' => [
                'name' => 'Кафедра машинобудування та транспорту',
                'city' => 'Харків',
            ],
            '6' => [
                'name' => 'Кафедра креативної педагогіки та інтелектуальної власності',
                'city' => 'Харків',
            ],
            '7' => [
                'name' => 'Кафедра інформаційних комп`ютерних технологій і математики',
                'city' => 'Харків',
            ],
            '8' => [
                'name' => 'Кафедра технологій і дизайну',
                'city' => 'Харків',
            ],
            '9' => [
                'name' => 'Кафедра харчових та хімічних технологій',
                'city' => 'Харків',
            ],
            '10' => [
                'name' => 'Кафедра іноземних мов',
                'city' => 'Харків',
            ],
            '11' => [
                'name' => 'Кафедра педагогіки, методики та менеджменту освіти',
                'city' => 'Харків',
            ],
            '12' => [
                'name' => 'Кафедра фізичного виховання',
                'city' => 'Харків',
            ],
            '13' => [
                'name' => 'Кафедра економіки та організації діяльності суб’єктів господарювання',
                'city' => 'Харків',
            ],
            '14' => [
                'name' => 'Кафедра менеджменту',
                'city' => 'Харків',
            ],
            '15' => [
                'name' => 'Кафедра філософії, українознавства та політології',
                'city' => 'Харків',
            ],
            '16' => [
                'name' => "Кафедра електромеханічних та комп'ютерних систем",
                'city' => 'Бахмут',
            ],
            '17' => [
                'name' => "Кафедра економіки підприємства та менеджменту",
                'city' => 'Бахмут',
            ],
            '18' => [
                'name' => "Кафедра інженерної педагогіки та психології",
                'city' => 'Бахмут',
            ],
            '19' => [
                'name' => "Кафедра охорони праці та екологічної безпеки",
                'city' => 'Бахмут',
            ],
        ];

        foreach ($departments as $key => $department) {
            DB::table('departments')->insert([
                'id' =>  $key,
                'department' =>  $department['name'],
                'city' =>  $department['city'],
            ]);

        }
    }
}
