<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class TypesOfWorksSeeder extends Seeder
{
    public function run(): void
    {
        $typesOfWorks = [
            "1" => [
                "type" => "Проведення планових наукових досліджень (виконання НДР другої половини дня)",
                "part" => "Інше",
                "title" => "Назва теми",
                "reference" => "Номер реєстрації",
            ],
            "2" => [
                "type" => "Підготовка науково-технічного звіту про виконання НДР другої половини дня",
                "part" => "Підготовка",
                "title" => "Назва теми",
                "reference" => "Номер реєстрації",
            ],
            "3" => [
                "type" => "Підготовка докторської дисертації до передзахисту/захисту",
                "part" => "Підготовка",
                "title" => "Назва теми",
                "reference" => "Рік захисту",
            ],
            "4" => [
                "type" => "Підготовка кандидатської дисертації до передзахисту/захисту",
                "part" => "Підготовка",
                "title" => "Назва теми",
                "reference" => "Рік захисту",
            ],
            "5" => [
                "type" => "Підготовка монографії для публікації в Україні",
                "part" => "Підготовка",
                "title" => "Бібліографічне описання",
                "reference" => "Посилання",
            ],
            "6" => [
                "type" => "Підготовка монографії для публікації за кордоном",
                "part" => "Підготовка",
                "title" => "Бібліографічне описання",
                "reference" => "Посилання",
            ],
            "7" => [
                "type" => "Підготовка запиту до участі у конкурсному відборі наукової роботи(проектів) бюджетного фінансування",
                "part" => "Підготовка",
                "title" => "Назва теми, обсяг фінансування",
                "reference" => "Посилання",
            ],
            "8" => [
                "type" => "Підготовка запиту на міжнародне фінансування (гранту)",
                "part" => "Підготовка",
                "title" => "Програма, назва теми, обсяг фінансування",
                "reference" => "Посилання",
            ],
            "9" => [
                "type" => "Підготовка наукових статей у науковометричних базах Scopus, Web of Science",
                "part" => "Підготовка",
                "title" => "Бібліографічне описання, DOI",
                "reference" => "Посилання",
            ],
            "10" => [
                "type" => "Підготовка наукових статей у зарубіжних наукових виданнях країн ОЕСтаР",
                "part" => "Підготовка",
                "title" => "Бібліографічне описання, DOI",
                "reference" => "Посилання",
            ],
            "11" => [
                "type" => "Підготовка наукових статей у фахових виданнях України",
                "part" => "Підготовка",
                "title" => "Бібліографічне описання, DOI",
                "reference" => "Посилання",
            ],
            "12" => [
                "type" => "Підготовка тез доповідей на міжнародних конференціях",
                "part" => "Підготовка",
                "title" => "Бібліографічне описання, DOI",
                "reference" => "Посилання",
            ],
            "13" => [
                "type" => "Підготовка тез доповідей на Всеукраїнських конференціях",
                "part" => "Підготовка",
                "title" => "Бібліографічне описання, DOI",
                "reference" => "Посилання",
            ],
            "14" => [
                "type" => "Підготовка тез доповідей на інших конференціях",
                "part" => "Підготовка",
                "title" => "Бібліографічне описання",
                "reference" => "Посилання",
            ],
            "15" => [
                "type" => "Підготовка заявки на винахід",
                "part" => "Підготовка",
                "title" => "Дані охоронного документу",
                "reference" => "Посилання",
            ],
            "16" => [
                "type" => "Підготовка заявки на корисну модель",
                "part" => "Підготовка",
                "title" => "Дані охоронного документу",
                "reference" => "Посилання",
            ],
            "17" => [
                "type" => "Підготовка заявки на об’єкт авторського права",
                "part" => "Підготовка",
                "title" => "Дані охоронного документу",
                "reference" => "Посилання",
            ],
            "18" => [
                "type" => "Підготовка рецензії на статтю",
                "part" => "Підготовка",
                "title" => "Бібліографічне описання статті",
                "reference" => "",
            ],
            "19" => [
                "type" => "Підготовка рецензії на автореферат кандидатської дисертації",
                "part" => "Підготовка",
                "title" => "Дисертант, тема, ЗВО",
                "reference" => "Посилання",
            ],
            "20" => [
                "type" => "Підготовка рецензії на автореферат докторської дисертації",
                "part" => "Підготовка",
                "title" => "Дисертант, тема, ЗВО",
                "reference" => "Посилання",
            ],
            "21" => [
                "type" => "Підготовка рецензії на монографію",
                "part" => "Підготовка",
                "title" => "Бібліографічне описання",
                "reference" => "Посилання",
            ],
            "22" => [
                "type" => "Керівництво студентів з підготовкою наукової статті",
                "part" => "Керівництво",
                "title" => "Бібліографічне описання",
                "reference" => "Посилання",
            ],
            "23" => [
                "type" => "Керівництво студентів з підготовкою заявки на корисну модель",
                "part" => "Керівництво",
                "title" => "Дані охоронного документу",
                "reference" => "Посилання",
            ],
            "24" => [
                "type" => "Керівництво студентів з підготовкою заявки на об’єкт авторського права",
                "part" => "Керівництво",
                "title" => "Дані охоронного документу",
                "reference" => "Посилання",
            ],
            "25" => [
                "type" => "Керівництво студентів з підготовкою роботи на ІІ тур Всеукраїнського конкурсу",
                "part" => "Керівництво",
                "title" => "ФІО студента, назва конкурсу, ЗВО, що проводив конкурс, місце",
                "reference" => "Посилання",
            ],
            "26" => [
                "type" => "Керівництво студентів з підготовкою роботи на регіональний конкурс",
                "part" => "Керівництво",
                "title" => "ФІО студента, назва роботи, місце",
                "reference" => "Посилання",
            ],
            "27" => [
                "type" => "Керівництво студентів з підготовкою до участі у ІІ етапі Всеукраїнської олімпіади",
                "part" => "Керівництво",
                "title" => "ФІО студента, назва олімпіади, ЗВО, що проводив олімпіаду, місце",
                "reference" => "Посилання",
            ],
            "28" => [
                "type" => "Керівництво студентів з підготовкою тез доповідей на міжнародних конференціях",
                "part" => "Керівництво",
                "title" => "Бібліографічне описання",
                "reference" => "Посилання",
            ],
            "29" => [
                "type" => "Керівництво студентів з підготовкою тез доповідей на Всеукраїнських конференціях",
                "part" => "Керівництво",
                "title" => "Бібліографічне описання",
                "reference" => "Посилання",
            ],
            "30" => [
                "type" => "Керівництво студентів з підготовкою тез доповідей на інших конференціях",
                "part" => "Керівництво",
                "title" => "Бібліографічне описання",
                "reference" => "Посилання",
            ],
            "31" => [
                "type" => "Переклад наукових матеріалів на англійську мову, (для кафедри іноземних мов)",
                "part" => "Інше",
                "title" => "Назва",
                "reference" => "Кількість сторінок",
            ],
            "32" => [
                "type" => "Переклад наукових матеріалів на державну мову, (для кафедри іноземних мов)",
                "part" => "Інше",
                "title" => "Назва",
                "reference" => "Кількість сторінок",
            ],
            "33" => [
                "type" => "Експертиза результатів навчально-наукової діяльності магістра",
                "part" => "Інше",
                "title" => "Описання",
                "reference" => "",
            ],
            "34" => [
                "type" => "Керівництво здобувачами вищої освіти ступеня «доктор філософії» денна форма Керівництво здобувачами наукового ступеня «доктор наук»",
                "part" => "Керівництво",
                "title" => "ФІО добувача, рік навчання",
                "reference" => "",
            ],
            "35" => [
                "type" => "Керівництво здобувачами вищої освіти ступеня «доктор філософії» заочна форма",
                "part" => "Керівництво",
                "title" => "ФІО добувача, рік навчання",
                "reference" => "",
            ],
        ];

        DB::table('types_of_works')->delete();

        foreach ($typesOfWorks as $key => $type) {
            DB::table('types_of_works')->insert([
                'id' =>  $key,
                'part' => $type['part'],
                "type" => $type['type'],
                "title" => $type['title'],
                "reference" => $type['reference'],
            ]);

        }
    }
}
