<?php

return [
    "user" => [
        "create" => "Користувач створений",
        "delete" => "Користувача видалено",
        "notFound" => "Коричстувача не знайдено",
        "alreadyExist" => "Корчистувач вже існує на кафедрі",
    ],

    "department" => [
        "create" => "Кафедру створено",
        "notFound" => "Кафедру не знайдено",
        "delete" => "Кафедра успішно видалена",
        "alreadyExist" => "Корчистувач вже існує на кафедрі",
        "userNotFound" => "Корчистувача не знайдено на кафедрі",
        "deleteUser" => "Корчистувача видалено з кафедри",
    ],

    "scientistProfile" => [
        "notFound" => "Профайл не знайдено",
        "create" => "Профайл створений",
        "assessDenied" => "Редагування заборонено",
        "delete" => "Профайл успішно видален",
    ],

    "typeOfWork" => [
        "notFound" => "Вид роботи не знайдено",
    ],
];